music_project/app/controllers/albums_controller.rb

    def index
        #@albums = Band.find_by(params[:id]).albums
        #debugger
        @albums = Album.all
        #debugger
        @band = Band.find_by(params[:id])
---
SELECT "albums".* FROM "albums"
SELECT  "bands".* FROM "bands" WHERE (1) LIMIT $1  [["LIMIT", 1]]

    def create
        @album = Album.new(album_params)
        if @album.save
---
INSERT INTO "albums" ("band_id", "title", "yr") VALUES ($1, $2, $3) RETURNING "id"  [["band_id", 1], ["title", "Slip Stitch & Pass"], ["yr", 2001]]

    def new
        @album = Album.new
        @bands = Band.all
---
SELECT "bands".* FROM "bands"